tutorials/DNS/dnsFoam/boxTurb16/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    patch0
    {
        type            cyclic;
        nFaces          512;
        startFace       11520;
        featureCos      0.9;
    }
    patch1
    {
        type            cyclic;
        nFaces          512;
        startFace       12032;
        featureCos      0.9;
    }
    patch2
    {
        type            cyclic;
        nFaces          512;
        startFace       12544;
        featureCos      0.9;
    }
)

// ************************************************************************* //
